{
  "title": "Skills",
  "list": [
    {
      "name": "Soft skill",
      "descriptions": [
        "It's easy for me to express what I'm thinking in a clear way."
      ]
    },
    {
      "name": "HTML/CSS",
      "descriptions": [
        "When I see a design or think of something I want to build it's clear to me how the markup and styling are gonna look."
      ]
    },
    {
      "name": "SQL",
      "descriptions": [
        "I can write from the simplest to the most complex queries, with subqueries and multiple joins."
      ]
    },
    {
      "name": "NextJs",
      "descriptions": [
        "I know the nuances of having React rendered on the server and separating server and client Javascript code."
      ]
    },
    {
      "name": "React",
      "descriptions": [
        "Fluid experience using it's structure to abstract problems."
      ]
    },
    {
      "name": "React Native",
      "descriptions": [
        "In adition to applying all my knowlege from React I am very familiar with it's peculiarities.",
        "It's very clear to me the process of compiling and publishing an app to both App Store and Google Play Store."
      ]
    },
    {
      "name": "Php Slim",
      "descriptions": [
        "I've written many REST APIs using php."
      ]
    },
    {
      "name": "Wordpress",
      "descriptions": [
        "I know how to install and serve wordpress using nginx.",
        "I'm able to install plugins and themes, customize or create custom ones."
      ]
    },
    {
      "name": "NodeJs/Express",
      "descriptions": [
        "I'm confortable with using the knowledge I have from using javascript on the client on the server."
      ]
    },
    {
      "name": "Java",
      "descriptions": [
        "I've written a REST API with a service to read from a RaspberryPi serial port."
      ]
    },
    {
      "name": "C/C++",
      "descriptions": [
        "I've  written code to read, process and output data using the esp32 and arduino for IoT applications."
      ]
    },
    {
      "name": "Deployment",
      "descriptions": [
        "I have the knowledge of how to merge branches, resolving different types of conflicts.",
        "Familiarity with linux, hosting and environment configuration."
      ]
    }
  ]
}
